export default {
    title: "Переустановка виндовс",
    navTitle: "Виндовс",
    id: "windows",
    items: [
        {
            summary: "Установка компактной Винды",
            content: 'Устанавливаем Винду на отформатированную флешку по ссылке:\n' +
                'Переходим по ссылке: https://nnmclub.to/forum/viewtopic.php?t=1490690\n' +
                'Нажимаем кнопку Скачать\n\n' +
                'Устанавливаем Торрент из сайта Qbittorrent.org (Синий фон такой)\n' +
                'Скачать новейшую версию и Виндовс x64\n' +
                'Устанавливаем и открываем торрент. Запускаем то что скачали по первой ссылке, кликаем Ок\n\n' +
                'Переходим по сайту Rufus.ie/ru/ и нажимаем на первый exe файл\n' +
                'Запускаем Руфус, нажимаем ВЫБРАТЬ, ищем файл созданный в результате скачанного с торрента файла\n' +
                'в Устройство выбираем ту флешку, куда собираюсь установить Винду, нажимаем СТАРТ затем ЗАКРЫТЬ. Извлекаем флешку\n\n\n' +
                'Устанавлиаем Винду на сам компьютер через флешку:\n' +
                'Вставляем флешку в выключенный пк, включаем и тыкаем клавишу Delete чтобы открыть Безопасный режим.\n' +
                'Вкладка Boot, Boot option UEFI, нажимаем f10.\n\n' +
                'Открывается спец окно от нашей новой Винды.\n' +
                'ОТКЛЮЧАЕМ Настройки интернет эксплорер\n' +
                'ОТКЛЮЧАЕМ Виндовс медиа плеер чтобы установить потом свой проигрыватель\n' +
                'ОТКЛЮЧАЕМ Настройки гибернации (это типо чтобы пк не выключался сам). На ноуте выкл, а на пк вкл\n' +
                'ОТКЛЮЧАЕМ файл подкачки. Не помню зачем, вроде жд жрёт\n' +
                'По желанию ВКЛЮЧАЕМ цвет заголовка для красоты\n' +
                'ВКЛЮЧИТЬ обязательно последнюю галочку про Visual++\n\n' +
                'Выбираем Windows 10 interprice, Установка\n' +
                'Выбираем нужный диск, нажимаем Удалить для очистки.\n\n\n' +
                'Отсебячина: Также я нашёл у себя в заметках инфу про драйвера. На всякий случай добавлю.\n' +
                'Win + R пишем msinfo32, ищем модель основной платы, копируем и пишем это в поиск с добавлением drivers.\n' +
                'Открываем первую ссылку, скачиваем те драйвера что нужны, выбирая самому индивидуально\n' +
                'Запускаем, распаковываем, ищем сетап или экзе файл (на этом обрывается)',
        },
    ]
};