const n={title:"Переустановка виндовс",navTitle:"Виндовс",id:"windows",items:[{summary:"Установка компактной Винды",content:`Устанавливаем Винду на отформатированную флешку по ссылке:
Переходим по ссылке: https://nnmclub.to/forum/viewtopic.php?t=1490690
Нажимаем кнопку Скачать

Устанавливаем Торрент из сайта Qbittorrent.org (Синий фон такой)
Скачать новейшую версию и Виндовс x64
Устанавливаем и открываем торрент. Запускаем то что скачали по первой ссылке, кликаем Ок

Переходим по сайту Rufus.ie/ru/ и нажимаем на первый exe файл
Запускаем Руфус, нажимаем ВЫБРАТЬ, ищем файл созданный в результате скачанного с торрента файла
в Устройство выбираем ту флешку, куда собираюсь установить Винду, нажимаем СТАРТ затем ЗАКРЫТЬ. Извлекаем флешку


Устанавлиаем Винду на сам компьютер через флешку:
Вставляем флешку в выключенный пк, включаем и тыкаем клавишу Delete чтобы открыть Безопасный режим.
Вкладка Boot, Boot option UEFI, нажимаем f10.

Открывается спец окно от нашей новой Винды.
ОТКЛЮЧАЕМ Настройки интернет эксплорер
ОТКЛЮЧАЕМ Виндовс медиа плеер чтобы установить потом свой проигрыватель
ОТКЛЮЧАЕМ Настройки гибернации (это типо чтобы пк не выключался сам). На ноуте выкл, а на пк вкл
ОТКЛЮЧАЕМ файл подкачки. Не помню зачем, вроде жд жрёт
По желанию ВКЛЮЧАЕМ цвет заголовка для красоты
ВКЛЮЧИТЬ обязательно последнюю галочку про Visual++

Выбираем Windows 10 interprice, Установка
Выбираем нужный диск, нажимаем Удалить для очистки.


Отсебячина: Также я нашёл у себя в заметках инфу про драйвера. На всякий случай добавлю.
Win + R пишем msinfo32, ищем модель основной платы, копируем и пишем это в поиск с добавлением drivers.
Открываем первую ссылку, скачиваем те драйвера что нужны, выбирая самому индивидуально
Запускаем, распаковываем, ищем сетап или экзе файл (на этом обрывается)`}]};export{n as default};
//# sourceMappingURL=windows-BySUyo2a.js.map
