const n={title:"Переустановка виндовс",navTitle:"Виндовс",id:"windows",items:[{summary:"Установка компактной Винды на флешку",content:`Устанавливаем Винду на отформатированную флешку по ссылке:
Переходим по ссылке: https://nnmclub.to/forum/viewtopic.php?t=1490690
Нажимаем кнопку Скачать

Устанавливаем Торрент из сайта Qbittorrent.org (Синий фон такой)
Скачать новейшую версию и Виндовс x64
Устанавливаем и открываем торрент. Запускаем то что скачали по первой ссылке, кликаем Ок

Переходим по сайту Rufus.ie/ru/ и нажимаем на первый exe файл
Запускаем Руфус, нажимаем ВЫБРАТЬ, ищем файл созданный в результате скачанного с торрента файла
в Устройство выбираем ту флешку, куда собираюсь установить Винду, нажимаем СТАРТ затем ЗАКРЫТЬ. Извлекаем флешку`},{summary:"Установка компактной Винды с флешки на пк",content:`Вставляем флешку в выключенный пк, включаем и тыкаем клавишу Delete чтобы открыть Безопасный режим.
Вкладка Boot, Boot option UEFI, нажимаем f10.

Открывается спец окно от нашей новой Винды.
ОТКЛЮЧАЕМ Настройки интернет эксплорер
ОТКЛЮЧАЕМ Виндовс медиа плеер чтобы установить потом свой проигрыватель
ОТКЛЮЧАЕМ Настройки гибернации (это типо чтобы пк не выключался сам). На ноуте выкл, а на пк вкл
ОТКЛЮЧАЕМ файл подкачки ТОЛЬКО если оперативки чересчур много и точно хватит (иначе не отключаем)
По желанию ВКЛЮЧАЕМ цвет заголовка для красоты
ВКЛЮЧИТЬ обязательно последнюю галочку про Visual++

Выбираем Windows 10 interprice, Установка
Выбираем нужный диск, нажимаем Удалить для очистки.`},{summary:"Действия после установки Винды",content:`0.Делаем пк юзабельным
Параметры -> Устройства -> Мышь: "Скорость курсора" на 13Параметры -> Персонализация -> Цвета: "Выбор цвета" на "Тёмный"
Параметры -> Система -> Питание и Спящий режим: Всё на 15-30 минут
Параметры -> Система -> Дисплей: "Масштаб" на 150%
Параметры -> Обновление и Безопастность -> Центр Обновления Windows -> Устанавливаем/Обновляем всё что там есть
(Если решил этого не делать, то надо вручную установить драйвера, например, на прокрутку тачпада для ноутбуков)
1.Установка Firefox
Вход в аккаунт
Установка остальных программ из закладок
Драйвер из тутора "Стабильная яркость от батареи"

2.Войти в BitWarden и задать ему пинкод

3.Войти в аккаунты
Telegramm
WhatsApp
Discord
Firefox
Firefox Developer Edition
Steam
WebStorm
Google (Outlook почта и в браузере)

4.Отключаем лишние анимации
Параметры -> Система -> О программе -> Дополнительные параметры системы
Во вкладке Дополнительно "Параметры быстродействия"
Отключаем всё кроме:
"Гладкое прокручивание списков"
"Отображение содержимого окна при перетаскивании"
"Сглаживание неровностей экранных списков"
"Вывод эскизов вместо значков"

Параметры -> Персонализация -> Цвета
Отключить "Эффект прозрасности"

5.Остальная настройка и не только
Удалить OutLook через параметры если он баганый
Установить Microsoft Store из тутора и phone link по ссылке
https://apps.microsoft.com/detail/9nmpj99vjbwv?hl=ru-ru&gl=PK
Установить Powertoys из Microsoft Store`},{summary:"Отсебячина",content:`Также я нашёл у себя в заметках инфу про драйвера. Если делать то нужно сразу после установки винды перед устанвокой программ.
На всякий случай добавлю.
Win + R пишем msinfo32, ищем модель основной платы, копируем и пишем это в поиск с добавлением drivers.
Открываем первую ссылку, скачиваем те драйвера что нужны, выбирая самому индивидуально
Запускаем, распаковываем, ищем сетап или экзе файл (на этом обрывается)`}]};export{n as default};
//# sourceMappingURL=windows-B6hNNfeO.js.map
